Tekla.Structures.ModelInternal.dotTemporaryStatesEnum
The possible temporary states. Used to temporarily change color
of a model object to visualize some state in the model.
Only use a state for its named purpose. If you need to make some
part orange even though it is not a modified part, talk to TORI
or ERFA about adding a new state. Do not use DOT_TEMPORARY_STATE_MODIFIED
unless the part is actually modified.

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_UNKNOWN
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_NEW
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_MODIFIED
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_DELETED
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_DM_ONGOING
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_UNCHANGED
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_ACTIVE
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_ORIGINAL
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_ACCEPTED
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_REJECTED
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_USE_EXISTING_REPRESENTATION
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_UNCHANGED_NATIVE
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_CHANGED_NATIVE
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_JUST_CONVERTED
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotTemporaryStatesEnum.DOT_TEMPORARY_STATE_ERROR
DO NOT USE! For internal usage only!